load-tests/test-results.txt
23:25-23:30

dogancaglar@Dogans-MacBook-Pro ecommerce-platform-kotlin % VUS=5 DURATION=5 k6 run load-tests/baseline-smoke-test.js

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/

     execution: local
        script: load-tests/baseline-smoke-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 5m30s max duration (incl. graceful stop):
              * default: 5 looping VUs for 5m0s (gracefulStop: 30s)

WARN[0000] Error from API server                         error="listen tcp 127.0.0.1:6565: bind: address already in use"


  █ TOTAL RESULTS

    checks_total.......................: 1465    4.866759/s
    checks_succeeded...................: 100.00% 1465 out of 1465
    checks_failed......................: 0.00%   0 out of 1465

    ✓ status is 200

    HTTP
    http_req_duration.......................................................: avg=25.79ms min=4ms med=19.22ms max=721.04ms p(90)=40.87ms p(95)=55.78ms
      { expected_response:true }............................................: avg=25.79ms min=4ms med=19.22ms max=721.04ms p(90)=40.87ms p(95)=55.78ms
    http_req_failed.........................................................: 0.00%  0 out of 1465
    http_reqs...............................................................: 1465   4.866759/s

    EXECUTION
    iteration_duration......................................................: avg=1.02s   min=1s  med=1.02s   max=1.72s    p(90)=1.04s   p(95)=1.05s
    iterations..............................................................: 1465   4.866759/s
    vus.....................................................................: 5      min=5         max=5
    vus_max.................................................................: 5      min=5         max=5

    NETWORK
    data_received...........................................................: 976 kB 3.2 kB/s
    data_sent...............................................................: 2.8 MB 9.3 kB/s



running (5m01.0s), 0/5 VUs, 1465 complete and 0 interrupted iterations
default ✓ [======================================] 5 VUs  5m0s


-----------------------

23:47-23:57
dogancaglar@Dogans-MacBook-Pro ecommerce-platform-kotlin % VUS=5 DURATION=10m k6 run load-tests/baseline-smoke-test.js

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/

     execution: local
        script: load-tests/baseline-smoke-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 5 looping VUs for 10m0s (gracefulStop: 30s)

WARN[0000] Error from API server                         error="listen tcp 127.0.0.1:6565: bind: address already in use"


  █ TOTAL RESULTS

    checks_total.......................: 2945    4.90795/s
    checks_succeeded...................: 100.00% 2945 out of 2945
    checks_failed......................: 0.00%   0 out of 2945

    ✓ status is 200

    HTTP
    http_req_duration.......................................................: avg=17.43ms min=2.89ms med=15.37ms max=73.63ms p(90)=29.78ms p(95)=35.2ms
      { expected_response:true }............................................: avg=17.43ms min=2.89ms med=15.37ms max=73.63ms p(90)=29.78ms p(95)=35.2ms
    http_req_failed.........................................................: 0.00%  0 out of 2945
    http_reqs...............................................................: 2945   4.90795/s

    EXECUTION
    iteration_duration......................................................: avg=1.01s   min=1s     med=1.01s   max=1.07s   p(90)=1.03s   p(95)=1.03s
    iterations..............................................................: 2945   4.90795/s
    vus.....................................................................: 5      min=5         max=5
    vus_max.................................................................: 5      min=5         max=5

    NETWORK
    data_received...........................................................: 2.0 MB 3.3 kB/s
    data_sent...............................................................: 5.6 MB 9.3 kB/s



00:06 - 00:16
dogancaglar@Dogans-MacBook-Pro ecommerce-platform-kotlin % VUS=10 DURATION=10m k6 run load-tests/baseline-smoke-test.js

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/

     execution: local
        script: load-tests/baseline-smoke-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 10 looping VUs for 10m0s (gracefulStop: 30s)

WARN[0000] Error from API server                         error="listen tcp 127.0.0.1:6565: bind: address already in use"


  █ TOTAL RESULTS

    checks_total.......................: 5880    9.792268/s
    checks_succeeded...................: 100.00% 5880 out of 5880
    checks_failed......................: 0.00%   0 out of 5880

    ✓ status is 200

    HTTP
    http_req_duration.......................................................: avg=20.23ms min=2.58ms med=16.33ms max=206.68ms p(90)=34.82ms p(95)=41.18ms
      { expected_response:true }............................................: avg=20.23ms min=2.58ms med=16.33ms max=206.68ms p(90)=34.82ms p(95)=41.18ms
    http_req_failed.........................................................: 0.00%  0 out of 5880
    http_reqs...............................................................: 5880   9.792268/s

    EXECUTION
    iteration_duration......................................................: avg=1.02s   min=1s     med=1.01s   max=1.2s     p(90)=1.03s   p(95)=1.04s
    iterations..............................................................: 5880   9.792268/s
    vus.....................................................................: 10     min=10        max=10
    vus_max.................................................................: 10     min=10        max=10

    NETWORK
    data_received...........................................................: 3.9 MB 6.5 kB/s
    data_sent...............................................................: 11 MB  19 kB/s



running (10m00.5s), 00/10 VUs, 5880 complete and 0 interrupted iterations
default ✓ [======================================] 10 VUs  10m0s